<details>
<summary>Execution result of "run-all plan" in "infrastructure/aws"</summary>

```terraform
17:14:39.813 INFO   The stack at /github/workspace/infrastructure/aws will be processed in the following order for command plan:
Group 1
- Module management/north-virginia/aws_accounts/playground
- Module management/north-virginia/aws_organization
- Module management/north-virginia/vpc
- Module playground/north-virginia/vpc


17:14:39.949 INFO   [management/north-virginia/vpc] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-vpc.git into /github/workspace/infrastructure/aws/management/north-virginia/vpc/.terragrunt-cache/tN8aN2Wrm1ax0JOoNGxYDj4UZc8/A35GeYiqYDYXDWZftKtd1kkU5ic
17:14:39.950 INFO   [management/north-virginia/aws_accounts/playground] Downloading Terraform configurations from file:///github/workspace/modules/aws/aws_account into /github/workspace/infrastructure/aws/management/north-virginia/aws_accounts/playground/.terragrunt-cache/pamcXYsh7Pqpp5BrO4tFjqhSqzs/10o_Yfon3CbB0MLOTJl69oEly1g
17:14:39.952 INFO   [management/north-virginia/aws_organization] Downloading Terraform configurations from file:///github/workspace/modules/aws/aws_organization into /github/workspace/infrastructure/aws/management/north-virginia/aws_organization/.terragrunt-cache/BmOb26uR7vqlaJoMBL_XANu2c6k/kLn2nKw80j_MBMKRZUlBCyiMAms
17:14:39.961 INFO   [playground/north-virginia/vpc] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-vpc.git into /github/workspace/infrastructure/aws/playground/north-virginia/vpc/.terragrunt-cache/_n5IKqt3mrmwcd0qdbmFt6RLz1g/A35GeYiqYDYXDWZftKtd1kkU5ic
17:14:40.613 STDOUT [management/north-virginia/aws_organization] tofu: Initializing the backend...
17:14:40.618 STDOUT [management/north-virginia/aws_accounts/playground] tofu: Initializing the backend...
17:14:40.641 STDOUT [management/north-virginia/vpc] tofu: Initializing the backend...
17:14:40.703 STDOUT [playground/north-virginia/vpc] tofu: Initializing the backend...
17:14:40.921 STDOUT [management/north-virginia/aws_organization] tofu: 
17:14:40.921 STDOUT [management/north-virginia/aws_organization] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
17:14:40.922 STDOUT [management/north-virginia/aws_organization] tofu: use this backend unless the backend configuration changes.
17:14:40.986 STDOUT [management/north-virginia/aws_accounts/playground] tofu: 
17:14:40.986 STDOUT [management/north-virginia/aws_accounts/playground] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
17:14:40.986 STDOUT [management/north-virginia/aws_accounts/playground] tofu: use this backend unless the backend configuration changes.
17:14:40.992 STDOUT [management/north-virginia/vpc] tofu: 
17:14:40.992 STDOUT [management/north-virginia/vpc] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
17:14:40.992 STDOUT [management/north-virginia/vpc] tofu: use this backend unless the backend configuration changes.
17:14:41.003 STDOUT [playground/north-virginia/vpc] tofu: 
17:14:41.003 STDOUT [playground/north-virginia/vpc] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
17:14:41.003 STDOUT [playground/north-virginia/vpc] tofu: use this backend unless the backend configuration changes.
17:14:41.017 STDOUT [management/north-virginia/aws_organization] tofu: Initializing provider plugins...
17:14:41.017 STDOUT [management/north-virginia/aws_organization] tofu: - Finding hashicorp/aws versions matching ">= 4.0.0"...
17:14:41.080 STDOUT [management/north-virginia/vpc] tofu: Initializing provider plugins...
17:14:41.080 STDOUT [management/north-virginia/vpc] tofu: - Finding hashicorp/aws versions matching ">= 5.79.0"...
17:14:41.135 STDOUT [playground/north-virginia/vpc] tofu: Initializing provider plugins...
17:14:41.135 STDOUT [playground/north-virginia/vpc] tofu: - Finding hashicorp/aws versions matching ">= 5.79.0"...
17:14:41.157 STDOUT [management/north-virginia/aws_accounts/playground] tofu: Initializing provider plugins...
17:14:41.157 STDOUT [management/north-virginia/aws_accounts/playground] tofu: - Finding hashicorp/aws versions matching ">= 4.0.0"...
17:14:41.670 STDOUT [management/north-virginia/aws_organization] tofu: - Installing hashicorp/aws v5.93.0...
17:14:41.671 STDOUT [playground/north-virginia/vpc] tofu: - Installing hashicorp/aws v5.93.0...
17:14:41.797 STDOUT [management/north-virginia/vpc] tofu: - Installing hashicorp/aws v5.93.0...
17:14:41.922 STDOUT [management/north-virginia/aws_accounts/playground] tofu: - Installing hashicorp/aws v5.93.0...
17:14:48.252 STDOUT [management/north-virginia/vpc] tofu: - Installed hashicorp/aws v5.93.0 (signed, key ID 0C0AF313E5FD9F80)
17:14:48.252 STDOUT [management/north-virginia/vpc] tofu: Providers are signed by their developers.
17:14:48.252 STDOUT [management/north-virginia/vpc] tofu: If you'd like to know more about provider signing, you can read about it here:
17:14:48.252 STDOUT [management/north-virginia/vpc] tofu: https://opentofu.org/docs/cli/plugins/signing/
17:14:48.252 STDOUT [management/north-virginia/vpc] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
17:14:48.252 STDOUT [management/north-virginia/vpc] tofu: selections it made above. Include this file in your version control repository
17:14:48.252 STDOUT [management/north-virginia/vpc] tofu: so that OpenTofu can guarantee to make the same selections by default when
17:14:48.252 STDOUT [management/north-virginia/vpc] tofu: you run "tofu init" in the future.
17:14:48.252 STDOUT [management/north-virginia/vpc] tofu: OpenTofu has been successfully initialized!
17:14:48.312 STDOUT [playground/north-virginia/vpc] tofu: - Installed hashicorp/aws v5.93.0 (signed, key ID 0C0AF313E5FD9F80)
17:14:48.312 STDOUT [playground/north-virginia/vpc] tofu: Providers are signed by their developers.
17:14:48.312 STDOUT [playground/north-virginia/vpc] tofu: If you'd like to know more about provider signing, you can read about it here:
17:14:48.312 STDOUT [playground/north-virginia/vpc] tofu: https://opentofu.org/docs/cli/plugins/signing/
17:14:48.312 STDOUT [playground/north-virginia/vpc] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
17:14:48.312 STDOUT [playground/north-virginia/vpc] tofu: selections it made above. Include this file in your version control repository
17:14:48.312 STDOUT [playground/north-virginia/vpc] tofu: so that OpenTofu can guarantee to make the same selections by default when
17:14:48.312 STDOUT [playground/north-virginia/vpc] tofu: you run "tofu init" in the future.
17:14:48.312 STDOUT [playground/north-virginia/vpc] tofu: OpenTofu has been successfully initialized!
17:14:48.571 STDOUT [management/north-virginia/aws_organization] tofu: - Installed hashicorp/aws v5.93.0 (signed, key ID 0C0AF313E5FD9F80)
17:14:48.572 STDOUT [management/north-virginia/aws_organization] tofu: Providers are signed by their developers.
17:14:48.572 STDOUT [management/north-virginia/aws_organization] tofu: If you'd like to know more about provider signing, you can read about it here:
17:14:48.572 STDOUT [management/north-virginia/aws_organization] tofu: https://opentofu.org/docs/cli/plugins/signing/
17:14:48.572 STDOUT [management/north-virginia/aws_organization] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
17:14:48.572 STDOUT [management/north-virginia/aws_organization] tofu: selections it made above. Include this file in your version control repository
17:14:48.572 STDOUT [management/north-virginia/aws_organization] tofu: so that OpenTofu can guarantee to make the same selections by default when
17:14:48.572 STDOUT [management/north-virginia/aws_organization] tofu: you run "tofu init" in the future.
17:14:48.572 STDOUT [management/north-virginia/aws_organization] tofu: OpenTofu has been successfully initialized!
17:14:48.902 STDOUT [management/north-virginia/aws_accounts/playground] tofu: - Installed hashicorp/aws v5.93.0 (signed, key ID 0C0AF313E5FD9F80)
17:14:48.902 STDOUT [management/north-virginia/aws_accounts/playground] tofu: Providers are signed by their developers.
17:14:48.902 STDOUT [management/north-virginia/aws_accounts/playground] tofu: If you'd like to know more about provider signing, you can read about it here:
17:14:48.902 STDOUT [management/north-virginia/aws_accounts/playground] tofu: https://opentofu.org/docs/cli/plugins/signing/
17:14:48.902 STDOUT [management/north-virginia/aws_accounts/playground] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
17:14:48.902 STDOUT [management/north-virginia/aws_accounts/playground] tofu: selections it made above. Include this file in your version control repository
17:14:48.902 STDOUT [management/north-virginia/aws_accounts/playground] tofu: so that OpenTofu can guarantee to make the same selections by default when
17:14:48.902 STDOUT [management/north-virginia/aws_accounts/playground] tofu: you run "tofu init" in the future.
17:14:48.902 STDOUT [management/north-virginia/aws_accounts/playground] tofu: OpenTofu has been successfully initialized!
17:14:53.482 STDOUT [management/north-virginia/aws_organization] tofu: aws_organizations_organization.org: Refreshing state... [id=o-4s1jxdnpu3]
17:14:53.499 STDOUT [management/north-virginia/vpc] tofu: No changes. Your infrastructure matches the configuration.
17:14:53.499 STDOUT [management/north-virginia/vpc] tofu: OpenTofu has compared your real infrastructure against your configuration and
17:14:53.499 STDOUT [management/north-virginia/vpc] tofu: found no differences, so no changes are needed.
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu: OpenTofu used the selected providers to generate the following execution
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu: plan. Resource actions are indicated with the following symbols:
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:   + create
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu: OpenTofu will perform the following actions:
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:   # aws_default_network_acl.this[0] will be created
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_default_network_acl" "this" {
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + arn                    = (known after apply)
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + default_network_acl_id = (known after apply)
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + id                     = (known after apply)
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + owner_id               = (known after apply)
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + tags                   = {
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-default"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all               = {
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-default"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "management"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + vpc_id                 = (known after apply)
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + egress {
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + action          = "allow"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + from_port       = 0
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block = "::/0"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + protocol        = "-1"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + rule_no         = 101
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + to_port         = 0
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + egress {
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + action     = "allow"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + cidr_block = "0.0.0.0/0"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + from_port  = 0
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + protocol   = "-1"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + rule_no    = 100
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + to_port    = 0
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + ingress {
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + action          = "allow"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + from_port       = 0
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block = "::/0"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + protocol        = "-1"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + rule_no         = 101
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + to_port         = 0
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + ingress {
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + action     = "allow"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + cidr_block = "0.0.0.0/0"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + from_port  = 0
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + protocol   = "-1"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + rule_no    = 100
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + to_port    = 0
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:   # aws_default_route_table.default[0] will be created
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_default_route_table" "default" {
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + arn                    = (known after apply)
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + default_route_table_id = (known after apply)
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + id                     = (known after apply)
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + owner_id               = (known after apply)
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + route                  = (known after apply)
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + tags                   = {
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-default"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all               = {
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-default"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "management"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + vpc_id                 = (known after apply)
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + timeouts {
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + create = "5m"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + update = "5m"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:   # aws_default_security_group.this[0] will be created
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_default_security_group" "this" {
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + arn                    = (known after apply)
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + description            = (known after apply)
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + egress                 = (known after apply)
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + id                     = (known after apply)
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + ingress                = (known after apply)
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + name                   = (known after apply)
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + name_prefix            = (known after apply)
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + owner_id               = (known after apply)
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + revoke_rules_on_delete = false
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + tags                   = {
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-default"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all               = {
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-default"
17:14:53.636 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "management"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + vpc_id                 = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:   # aws_eip.nat[0] will be created
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_eip" "nat" {
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + allocation_id        = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + arn                  = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + association_id       = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + carrier_ip           = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + customer_owned_ip    = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + domain               = "vpc"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + id                   = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + instance             = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + ipam_pool_id         = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + network_border_group = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + network_interface    = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + private_dns          = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + private_ip           = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + ptr_record           = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + public_dns           = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + public_ip            = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + public_ipv4_pool     = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + tags                 = {
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-eu-east-1a"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all             = {
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-eu-east-1a"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "management"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + vpc                  = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:   # aws_eip.nat[1] will be created
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_eip" "nat" {
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + allocation_id        = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + arn                  = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + association_id       = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + carrier_ip           = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + customer_owned_ip    = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + domain               = "vpc"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + id                   = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + instance             = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + ipam_pool_id         = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + network_border_group = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + network_interface    = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + private_dns          = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + private_ip           = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + ptr_record           = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + public_dns           = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + public_ip            = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + public_ipv4_pool     = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + tags                 = {
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-eu-east-1b"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all             = {
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-eu-east-1b"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "management"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + vpc                  = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:   # aws_eip.nat[2] will be created
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_eip" "nat" {
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + allocation_id        = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + arn                  = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + association_id       = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + carrier_ip           = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + customer_owned_ip    = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + domain               = "vpc"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + id                   = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + instance             = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + ipam_pool_id         = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + network_border_group = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + network_interface    = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + private_dns          = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + private_ip           = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + ptr_record           = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + public_dns           = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + public_ip            = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + public_ipv4_pool     = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + tags                 = {
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-eu-east-1c"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all             = {
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-eu-east-1c"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "management"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + vpc                  = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:   # aws_internet_gateway.this[0] will be created
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_internet_gateway" "this" {
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + arn      = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + id       = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + owner_id = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + tags     = {
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all = {
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "management"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + vpc_id   = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:   # aws_nat_gateway.this[0] will be created
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_nat_gateway" "this" {
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + allocation_id                      = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + association_id                     = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + connectivity_type                  = "public"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + id                                 = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + network_interface_id               = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + private_ip                         = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + public_ip                          = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + secondary_private_ip_address_count = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + secondary_private_ip_addresses     = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + subnet_id                          = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + tags                               = {
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-eu-east-1a"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all                           = {
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-eu-east-1a"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "management"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:   # aws_nat_gateway.this[1] will be created
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_nat_gateway" "this" {
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + allocation_id                      = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + association_id                     = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + connectivity_type                  = "public"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + id                                 = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + network_interface_id               = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + private_ip                         = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + public_ip                          = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + secondary_private_ip_address_count = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + secondary_private_ip_addresses     = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + subnet_id                          = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + tags                               = {
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-eu-east-1b"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all                           = {
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-eu-east-1b"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "management"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:   # aws_nat_gateway.this[2] will be created
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_nat_gateway" "this" {
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + allocation_id                      = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + association_id                     = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + connectivity_type                  = "public"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + id                                 = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + network_interface_id               = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + private_ip                         = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + public_ip                          = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + secondary_private_ip_address_count = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + secondary_private_ip_addresses     = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + subnet_id                          = (known after apply)
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + tags                               = {
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-eu-east-1c"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all                           = {
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-eu-east-1c"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "management"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.637 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route.private_nat_gateway[0] will be created
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_route" "private_nat_gateway" {
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + destination_cidr_block = "0.0.0.0/0"
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + id                     = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + instance_id            = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + instance_owner_id      = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + nat_gateway_id         = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + network_interface_id   = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + origin                 = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + route_table_id         = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + state                  = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + timeouts {
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:           + create = "5m"
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route.private_nat_gateway[1] will be created
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_route" "private_nat_gateway" {
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + destination_cidr_block = "0.0.0.0/0"
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + id                     = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + instance_id            = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + instance_owner_id      = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + nat_gateway_id         = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + network_interface_id   = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + origin                 = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + route_table_id         = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + state                  = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + timeouts {
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:           + create = "5m"
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route.private_nat_gateway[2] will be created
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_route" "private_nat_gateway" {
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + destination_cidr_block = "0.0.0.0/0"
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + id                     = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + instance_id            = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + instance_owner_id      = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + nat_gateway_id         = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + network_interface_id   = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + origin                 = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + route_table_id         = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + state                  = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + timeouts {
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:           + create = "5m"
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route.public_internet_gateway[0] will be created
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_route" "public_internet_gateway" {
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + destination_cidr_block = "0.0.0.0/0"
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + gateway_id             = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + id                     = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + instance_id            = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + instance_owner_id      = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + network_interface_id   = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + origin                 = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + route_table_id         = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + state                  = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + timeouts {
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:           + create = "5m"
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route_table.private[0] will be created
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_route_table" "private" {
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + arn              = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + id               = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + owner_id         = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + propagating_vgws = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + route            = (known after apply)
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + tags             = {
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-private-eu-east-1a"
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all         = {
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-private-eu-east-1a"
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "management"
17:14:53.638 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:       + vpc_id           = (known after apply)
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route_table.private[1] will be created
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_route_table" "private" {
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:       + arn              = (known after apply)
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:       + id               = (known after apply)
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:       + owner_id         = (known after apply)
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:       + propagating_vgws = (known after apply)
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:       + route            = (known after apply)
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:       + tags             = {
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-private-eu-east-1b"
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all         = {
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-private-eu-east-1b"
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "management"
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:       + vpc_id           = (known after apply)
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route_table.private[2] will be created
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_route_table" "private" {
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:       + arn              = (known after apply)
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:       + id               = (known after apply)
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:       + owner_id         = (known after apply)
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:       + propagating_vgws = (known after apply)
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:       + route            = (known after apply)
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:       + tags             = {
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-private-eu-east-1c"
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all         = {
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-private-eu-east-1c"
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "management"
17:14:53.639 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:       + vpc_id           = (known after apply)
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route_table.public[0] will be created
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_route_table" "public" {
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:       + arn              = (known after apply)
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:       + id               = (known after apply)
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:       + owner_id         = (known after apply)
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:       + propagating_vgws = (known after apply)
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:       + route            = (known after apply)
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:       + tags             = {
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-public"
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all         = {
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-public"
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "management"
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:       + vpc_id           = (known after apply)
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route_table_association.private[0] will be created
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_route_table_association" "private" {
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:       + id             = (known after apply)
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:       + route_table_id = (known after apply)
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:       + subnet_id      = (known after apply)
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route_table_association.private[1] will be created
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_route_table_association" "private" {
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:       + id             = (known after apply)
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:       + route_table_id = (known after apply)
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:       + subnet_id      = (known after apply)
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route_table_association.private[2] will be created
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_route_table_association" "private" {
17:14:53.642 STDOUT [playground/north-virginia/vpc] tofu:       + id             = (known after apply)
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + route_table_id = (known after apply)
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + subnet_id      = (known after apply)
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route_table_association.public[0] will be created
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_route_table_association" "public" {
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + id             = (known after apply)
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + route_table_id = (known after apply)
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + subnet_id      = (known after apply)
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route_table_association.public[1] will be created
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_route_table_association" "public" {
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + id             = (known after apply)
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + route_table_id = (known after apply)
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + subnet_id      = (known after apply)
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:   # aws_route_table_association.public[2] will be created
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_route_table_association" "public" {
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + id             = (known after apply)
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + route_table_id = (known after apply)
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + subnet_id      = (known after apply)
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:   # aws_subnet.private[0] will be created
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_subnet" "private" {
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + arn                                            = (known after apply)
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + assign_ipv6_address_on_creation                = false
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + availability_zone                              = "eu-east-1a"
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + availability_zone_id                           = (known after apply)
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + cidr_block                                     = "10.0.1.0/24"
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + enable_dns64                                   = false
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + enable_resource_name_dns_a_record_on_launch    = false
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + id                                             = (known after apply)
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_native                                    = false
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + map_public_ip_on_launch                        = false
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + owner_id                                       = (known after apply)
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + tags                                           = {
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-private-eu-east-1a"
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all                                       = {
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-private-eu-east-1a"
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "management"
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:       + vpc_id                                         = (known after apply)
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.643 STDOUT [playground/north-virginia/vpc] tofu:   # aws_subnet.private[1] will be created
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_subnet" "private" {
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + arn                                            = (known after apply)
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + assign_ipv6_address_on_creation                = false
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + availability_zone                              = "eu-east-1b"
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + availability_zone_id                           = (known after apply)
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + cidr_block                                     = "10.0.2.0/24"
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + enable_dns64                                   = false
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + enable_resource_name_dns_a_record_on_launch    = false
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + id                                             = (known after apply)
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_native                                    = false
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + map_public_ip_on_launch                        = false
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + owner_id                                       = (known after apply)
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + tags                                           = {
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-private-eu-east-1b"
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all                                       = {
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-private-eu-east-1b"
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "management"
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + vpc_id                                         = (known after apply)
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:   # aws_subnet.private[2] will be created
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_subnet" "private" {
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + arn                                            = (known after apply)
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + assign_ipv6_address_on_creation                = false
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + availability_zone                              = "eu-east-1c"
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + availability_zone_id                           = (known after apply)
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + cidr_block                                     = "10.0.3.0/24"
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + enable_dns64                                   = false
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + enable_resource_name_dns_a_record_on_launch    = false
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + id                                             = (known after apply)
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_native                                    = false
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + map_public_ip_on_launch                        = false
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + owner_id                                       = (known after apply)
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + tags                                           = {
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-private-eu-east-1c"
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all                                       = {
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-private-eu-east-1c"
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "management"
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + vpc_id                                         = (known after apply)
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:   # aws_subnet.public[0] will be created
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_subnet" "public" {
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + arn                                            = (known after apply)
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + assign_ipv6_address_on_creation                = false
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + availability_zone                              = "eu-east-1a"
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + availability_zone_id                           = (known after apply)
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + cidr_block                                     = "10.0.101.0/24"
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + enable_dns64                                   = false
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + enable_resource_name_dns_a_record_on_launch    = false
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + id                                             = (known after apply)
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_native                                    = false
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + map_public_ip_on_launch                        = false
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + owner_id                                       = (known after apply)
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + tags                                           = {
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-public-eu-east-1a"
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all                                       = {
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-public-eu-east-1a"
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:14:53.644 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "management"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + vpc_id                                         = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   # aws_subnet.public[1] will be created
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_subnet" "public" {
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + arn                                            = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + assign_ipv6_address_on_creation                = false
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + availability_zone                              = "eu-east-1b"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + availability_zone_id                           = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + cidr_block                                     = "10.0.102.0/24"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + enable_dns64                                   = false
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + enable_resource_name_dns_a_record_on_launch    = false
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + id                                             = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_native                                    = false
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + map_public_ip_on_launch                        = false
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + owner_id                                       = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + tags                                           = {
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-public-eu-east-1b"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all                                       = {
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-public-eu-east-1b"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "management"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + vpc_id                                         = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   # aws_subnet.public[2] will be created
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_subnet" "public" {
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + arn                                            = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + assign_ipv6_address_on_creation                = false
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + availability_zone                              = "eu-east-1c"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + availability_zone_id                           = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + cidr_block                                     = "10.0.103.0/24"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + enable_dns64                                   = false
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + enable_resource_name_dns_a_record_on_launch    = false
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + enable_resource_name_dns_aaaa_record_on_launch = false
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + id                                             = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_cidr_block_association_id                 = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_native                                    = false
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + map_public_ip_on_launch                        = false
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + owner_id                                       = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + private_dns_hostname_type_on_launch            = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + tags                                           = {
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc-public-eu-east-1c"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all                                       = {
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc-public-eu-east-1c"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "management"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + vpc_id                                         = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   # aws_vpc.this[0] will be created
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_vpc" "this" {
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + arn                                  = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + cidr_block                           = "10.0.0.0/16"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + default_network_acl_id               = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + default_route_table_id               = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + default_security_group_id            = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + dhcp_options_id                      = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + enable_dns_hostnames                 = true
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + enable_dns_support                   = true
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + enable_network_address_usage_metrics = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + id                                   = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + instance_tenancy                     = "default"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_association_id                  = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_cidr_block                      = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + ipv6_cidr_block_network_border_group = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + main_route_table_id                  = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + owner_id                             = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + tags                                 = {
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all                             = {
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "management"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   # aws_vpn_gateway.this[0] will be created
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + resource "aws_vpn_gateway" "this" {
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + amazon_side_asn = "64512"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + arn             = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + id              = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + tags            = {
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "Name" = "my-vpc"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + tags_all        = {
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "Name"        = "my-vpc"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "creator"     = "terraform/terragrunt"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "environment" = "management"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "platform"    = "aws"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "project"     = "iac"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + "team"        = "devops"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:         }
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + vpc_id          = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:     }
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu: Plan: 32 to add, 0 to change, 0 to destroy.
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu: 
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu: Changes to Outputs:
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + azs                                         = [
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + "eu-east-1a",
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + "eu-east-1b",
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + "eu-east-1c",
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + cgw_arns                                    = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + cgw_ids                                     = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + database_nat_gateway_route_ids              = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + database_route_table_association_ids        = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + database_route_table_ids                    = [
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + database_subnet_arns                        = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + database_subnet_objects                     = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + database_subnets                            = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + database_subnets_cidr_blocks                = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + database_subnets_ipv6_cidr_blocks           = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + default_network_acl_id                      = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + default_route_table_id                      = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + default_security_group_id                   = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + elasticache_route_table_association_ids     = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + elasticache_route_table_ids                 = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + elasticache_subnet_arns                     = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + elasticache_subnet_objects                  = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + elasticache_subnets                         = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + elasticache_subnets_cidr_blocks             = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + elasticache_subnets_ipv6_cidr_blocks        = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + igw_arn                                     = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + igw_id                                      = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + intra_route_table_association_ids           = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + intra_route_table_ids                       = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + intra_subnet_arns                           = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + intra_subnet_objects                        = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + intra_subnets                               = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + intra_subnets_cidr_blocks                   = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + intra_subnets_ipv6_cidr_blocks              = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + name                                        = "my-vpc"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + nat_ids                                     = [
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + nat_public_ips                              = [
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + natgw_ids                                   = [
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + natgw_interface_ids                         = [
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + outpost_subnet_arns                         = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + outpost_subnet_objects                      = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + outpost_subnets                             = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + outpost_subnets_cidr_blocks                 = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + outpost_subnets_ipv6_cidr_blocks            = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + private_ipv6_egress_route_ids               = []
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + private_nat_gateway_route_ids               = [
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + private_route_table_association_ids         = [
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + private_route_table_ids                     = [
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + private_subnet_arns                         = [
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:   + private_subnet_objects                      = [
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:       + {
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + arn                                            = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + assign_ipv6_address_on_creation                = false
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + availability_zone                              = "eu-east-1a"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + availability_zone_id                           = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + cidr_block                                     = "10.0.1.0/24"
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + customer_owned_ipv4_pool                       = null
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + enable_dns64                                   = false
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + enable_lni_at_device_index                     = null
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + enable_resource_name_dns_a_record_on_launch    = false
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + enable_resource_name_dns_aaaa_record_on_launch = false
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + id                                             = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block                                = null
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block_association_id                 = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_native                                    = false
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + map_customer_owned_ip_on_launch                = null
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + map_public_ip_on_launch                        = false
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + outpost_arn                                    = null
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + owner_id                                       = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + private_dns_hostname_type_on_launch            = (known after apply)
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:           + tags                                           = {
17:14:53.645 STDOUT [playground/north-virginia/vpc] tofu:               + Name = "my-vpc-private-eu-east-1a"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:             }
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + tags_all                                       = {
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + Name        = "my-vpc-private-eu-east-1a"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + creator     = "terraform/terragrunt"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + environment = "management"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + platform    = "aws"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + project     = "iac"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + team        = "devops"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:             }
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + timeouts                                       = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + vpc_id                                         = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:         },
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:       + {
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + arn                                            = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + assign_ipv6_address_on_creation                = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + availability_zone                              = "eu-east-1b"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + availability_zone_id                           = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + cidr_block                                     = "10.0.2.0/24"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + customer_owned_ipv4_pool                       = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + enable_dns64                                   = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + enable_lni_at_device_index                     = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + enable_resource_name_dns_a_record_on_launch    = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + enable_resource_name_dns_aaaa_record_on_launch = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + id                                             = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block                                = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block_association_id                 = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_native                                    = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + map_customer_owned_ip_on_launch                = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + map_public_ip_on_launch                        = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + outpost_arn                                    = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + owner_id                                       = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + private_dns_hostname_type_on_launch            = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + tags                                           = {
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + Name = "my-vpc-private-eu-east-1b"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:             }
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + tags_all                                       = {
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + Name        = "my-vpc-private-eu-east-1b"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + creator     = "terraform/terragrunt"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + environment = "management"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + platform    = "aws"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + project     = "iac"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + team        = "devops"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:             }
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + timeouts                                       = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + vpc_id                                         = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:         },
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:       + {
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + arn                                            = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + assign_ipv6_address_on_creation                = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + availability_zone                              = "eu-east-1c"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + availability_zone_id                           = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + cidr_block                                     = "10.0.3.0/24"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + customer_owned_ipv4_pool                       = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + enable_dns64                                   = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + enable_lni_at_device_index                     = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + enable_resource_name_dns_a_record_on_launch    = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + enable_resource_name_dns_aaaa_record_on_launch = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + id                                             = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block                                = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block_association_id                 = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_native                                    = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + map_customer_owned_ip_on_launch                = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + map_public_ip_on_launch                        = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + outpost_arn                                    = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + owner_id                                       = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + private_dns_hostname_type_on_launch            = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + tags                                           = {
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + Name = "my-vpc-private-eu-east-1c"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:             }
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + tags_all                                       = {
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + Name        = "my-vpc-private-eu-east-1c"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + creator     = "terraform/terragrunt"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + environment = "management"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + platform    = "aws"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + project     = "iac"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + team        = "devops"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:             }
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + timeouts                                       = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + vpc_id                                         = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:         },
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:   + private_subnets                             = [
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:   + private_subnets_cidr_blocks                 = [
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:       + "10.0.1.0/24",
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:       + "10.0.2.0/24",
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:       + "10.0.3.0/24",
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:   + private_subnets_ipv6_cidr_blocks            = []
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:   + public_internet_gateway_route_id            = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:   + public_route_table_association_ids          = [
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:   + public_route_table_ids                      = [
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:   + public_subnet_arns                          = [
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:   + public_subnet_objects                       = [
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:       + {
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + arn                                            = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + assign_ipv6_address_on_creation                = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + availability_zone                              = "eu-east-1a"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + availability_zone_id                           = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + cidr_block                                     = "10.0.101.0/24"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + customer_owned_ipv4_pool                       = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + enable_dns64                                   = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + enable_lni_at_device_index                     = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + enable_resource_name_dns_a_record_on_launch    = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + enable_resource_name_dns_aaaa_record_on_launch = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + id                                             = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block                                = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block_association_id                 = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_native                                    = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + map_customer_owned_ip_on_launch                = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + map_public_ip_on_launch                        = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + outpost_arn                                    = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + owner_id                                       = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + private_dns_hostname_type_on_launch            = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + tags                                           = {
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + Name = "my-vpc-public-eu-east-1a"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:             }
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + tags_all                                       = {
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + Name        = "my-vpc-public-eu-east-1a"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + creator     = "terraform/terragrunt"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + environment = "management"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + platform    = "aws"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + project     = "iac"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + team        = "devops"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:             }
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + timeouts                                       = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + vpc_id                                         = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:         },
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:       + {
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + arn                                            = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + assign_ipv6_address_on_creation                = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + availability_zone                              = "eu-east-1b"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + availability_zone_id                           = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + cidr_block                                     = "10.0.102.0/24"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + customer_owned_ipv4_pool                       = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + enable_dns64                                   = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + enable_lni_at_device_index                     = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + enable_resource_name_dns_a_record_on_launch    = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + enable_resource_name_dns_aaaa_record_on_launch = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + id                                             = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block                                = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block_association_id                 = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_native                                    = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + map_customer_owned_ip_on_launch                = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + map_public_ip_on_launch                        = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + outpost_arn                                    = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + owner_id                                       = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + private_dns_hostname_type_on_launch            = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + tags                                           = {
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + Name = "my-vpc-public-eu-east-1b"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:             }
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + tags_all                                       = {
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + Name        = "my-vpc-public-eu-east-1b"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + creator     = "terraform/terragrunt"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + environment = "management"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + platform    = "aws"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + project     = "iac"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + team        = "devops"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:             }
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + timeouts                                       = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + vpc_id                                         = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:         },
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:       + {
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + arn                                            = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + assign_ipv6_address_on_creation                = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + availability_zone                              = "eu-east-1c"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + availability_zone_id                           = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + cidr_block                                     = "10.0.103.0/24"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + customer_owned_ipv4_pool                       = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + enable_dns64                                   = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + enable_lni_at_device_index                     = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + enable_resource_name_dns_a_record_on_launch    = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + enable_resource_name_dns_aaaa_record_on_launch = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + id                                             = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block                                = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_cidr_block_association_id                 = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + ipv6_native                                    = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + map_customer_owned_ip_on_launch                = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + map_public_ip_on_launch                        = false
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + outpost_arn                                    = null
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + owner_id                                       = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + private_dns_hostname_type_on_launch            = (known after apply)
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + tags                                           = {
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + Name = "my-vpc-public-eu-east-1c"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:             }
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:           + tags_all                                       = {
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + Name        = "my-vpc-public-eu-east-1c"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + creator     = "terraform/terragrunt"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + environment = "management"
17:14:53.646 STDOUT [playground/north-virginia/vpc] tofu:               + platform    = "aws"
17:14:53.647 STDOUT [playground/north-virginia/vpc] tofu:               + project     = "iac"
17:14:53.647 STDOUT [playground/north-virginia/vpc] tofu:               + team        = "devops"
17:14:53.647 STDOUT [playground/north-virginia/vpc] tofu:             }
17:14:53.647 STDOUT [playground/north-virginia/vpc] tofu:           + timeouts                                       = null
17:14:53.647 STDOUT [playground/north-virginia/vpc] tofu:           + vpc_id                                         = (known after apply)
17:14:53.647 STDOUT [playground/north-virginia/vpc] tofu:         },
17:14:53.647 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:14:53.647 STDOUT [playground/north-virginia/vpc] tofu:   + public_subnets                              = [
17:14:53.647 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.647 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.647 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.647 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:14:53.647 STDOUT [playground/north-virginia/vpc] tofu:   + public_subnets_cidr_blocks                  = [
17:14:53.647 STDOUT [playground/north-virginia/vpc] tofu:       + "10.0.101.0/24",
17:14:53.647 STDOUT [playground/north-virginia/vpc] tofu:       + "10.0.102.0/24",
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:       + "10.0.103.0/24",
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + public_subnets_ipv6_cidr_blocks             = []
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + redshift_public_route_table_association_ids = []
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + redshift_route_table_association_ids        = []
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + redshift_route_table_ids                    = [
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:       + (known after apply),
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:     ]
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + redshift_subnet_arns                        = []
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + redshift_subnet_objects                     = []
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + redshift_subnets                            = []
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + redshift_subnets_cidr_blocks                = []
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + redshift_subnets_ipv6_cidr_blocks           = []
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + this_customer_gateway                       = {}
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + vgw_arn                                     = (known after apply)
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + vgw_id                                      = (known after apply)
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + vpc_arn                                     = (known after apply)
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + vpc_block_public_access_exclusions          = {}
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + vpc_cidr_block                              = "10.0.0.0/16"
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + vpc_enable_dns_hostnames                    = true
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + vpc_enable_dns_support                      = true
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + vpc_flow_log_cloudwatch_iam_role_arn        = ""
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + vpc_flow_log_destination_arn                = ""
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + vpc_flow_log_destination_type               = "cloud-watch-logs"
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + vpc_id                                      = (known after apply)
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + vpc_instance_tenancy                        = "default"
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + vpc_ipv6_association_id                     = (known after apply)
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + vpc_ipv6_cidr_block                         = (known after apply)
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + vpc_main_route_table_id                     = (known after apply)
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + vpc_owner_id                                = (known after apply)
17:14:53.648 STDOUT [playground/north-virginia/vpc] tofu:   + vpc_secondary_cidr_blocks                   = []
17:14:53.659 STDOUT [management/north-virginia/aws_accounts/playground] tofu: aws_organizations_account.account: Refreshing state... [id=672491114190]
17:14:54.158 STDOUT [management/north-virginia/aws_organization] tofu: No changes. Your infrastructure matches the configuration.
17:14:54.159 STDOUT [management/north-virginia/aws_organization] tofu: OpenTofu has compared your real infrastructure against your configuration and
17:14:54.159 STDOUT [management/north-virginia/aws_organization] tofu: found no differences, so no changes are needed.
17:14:54.175 STDOUT [management/north-virginia/aws_accounts/playground] tofu: No changes. Your infrastructure matches the configuration.
17:14:54.175 STDOUT [management/north-virginia/aws_accounts/playground] tofu: OpenTofu has compared your real infrastructure against your configuration and
17:14:54.175 STDOUT [management/north-virginia/aws_accounts/playground] tofu: found no differences, so no changes are needed.
```

</details>
    
